'''

_____________________ СПИСКИ (Массивы) ________________________

    mylist = []         - пустой список
    mylist = list()     - тоже пустой список


    info = ['Timur', 1992, 61.5]       - может содержать значения разных типов данных:
    info[0] == 'Timur';
    print(info)                -  вывод списка



    list() -  преобразовать некоторые типы объектов в списки.

        numbers = list(range(5))                        [0, 1, 2, 3, 4]
        ven_numbers = list(range(0, 10, 2))             [0, 2, 4, 6, 8]

        s = 'abcde'
        chars = list(s)                         ['a', 'b', 'c', 'd', 'e']



_____________________ ИНДЕКСАЦИЯ И СРЕЗЫ ________________________

    Аналогично строкам

    numbers = [2, 4, 6, 8, 10]

    len(numbers)        - 5, длина списка
    2 in numbers        - оператор in
    0 not in numbers    - оператор not in
    numbers[1]	4       - индексация сначала
    numbers[-1] 10      - индексация сконца
    numbers[1:3]        - [4, 6]  - срез , 1-включительно, 3 - не включительно
    sum(numbers)        - сумма элементов
    min(numbers)        - минимальный элемент
    max(numbers)        - максимальный элемент


    Использование срезов для изменения элементов в заданном диапазоне

            s[1] = 'x'           - ошибка,   строки — неизменяемые объекты!
            numbers[1] = 101     - изменяется,  списки – изменяемые объекты!


                fruits =        ['apple', 'apricot', 'banana', 'cherry', 'kiwi', 'lemon', 'mango']
                fruits[2:5] =   ['банан', 'вишня', 'киви']
                fruits     -    ['apple', 'apricot', 'банан', 'вишня', 'киви', 'lemon', 'mango']




    Операторы  +   и   *

        [1, 2, 3, 4]     +    [5, 6, 7, 8]       -   [1, 2, 3, 4, 5, 6, 7, 8]
        [7, 8]   *   3                           -   [7, 8, 7, 8, 7, 8]
        [0]   *  10                              -   [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]




'''

n = int(input())
code = ord('a')
string = ''
for i in range(n):
    string = string + chr(code)
    code = code + 1
print(list(string))
